3-Sinter_vs_Microchannel_Comparison/1uW_load_envelope/Cu_2p0_s12p5/0/fluid_he/p
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/fluid_he";
    object      p;
}
// Absolute pressure consistent with p_rgh=0 (g=0 so p=p_rgh)
dimensions      [ 1 -1 -2 0 0 0 0 ];
internalField   uniform 0;
boundaryField
{
    inlet                  { type zeroGradient; }
    outlet                 { type fixedValue; value uniform 0; }
    fluid_he_to_solid_wall { type fixedFluxPressure; value uniform 0; }
}
