3-Sinter_vs_Microchannel_Comparison/1uW_load_envelope/Cu_2p0_s12p5/0/domain4/alphat
FoamFile
{
    version 2.0; format ascii;
    class volScalarField; location "0/domain4"; object alphat;
}
dimensions [1 -1 -1 0 0 0 0];
internalField uniform 0;
boundaryField
{
    inlet { type calculated; value uniform 0; }
    outlet { type calculated; value uniform 0; }
    domain4_to_solid_wall { type compressible::alphatWallFunction; value uniform 0; }
}
